# СОЗДАНИЕ MERGE-BRANCH-CONFLICT ПУТЁМ ОДНОВРЕМЕННОГО СОЗДАНИЯ ФАЙЛОВ В ВЕТКЕ MAIN.
#
# Создать на 1 ПК файл 3_test_file.py с записью # Создан 3_test_file.py на 1 ПК и сделать commit: added 3_test_file
#
# Не заливать изменения на github!!!
#
# Создать на 2 ПК файл 4_test_file.py записью # Создан 4_test_file, сделать commit: added 4_test_file,
# залить изменения на github.
#
# Подгрузить на 1 ПК данные с github (увидеть что там есть изменения).
#
# Сделать pull и столкнуться с необходимостью создания merge-branch commit поскольку с github пришёл ещё одни файл,
# созданный параллельно на работе и залитый до этого момента на github.
#
# Сделать merge-branch commit и залить изменения на github.
#
# На 2 ПК сделать pull изменений.

#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#