# Если этого не было сделано сделать первоначальные настройки git
#
# СПОСОБ КОГДА УЖЕ СУЩЕСТВУЕТ ЛОКАЛЬНЫЙ РЕПОЗИТОРИЙ И ЕГО НАДО ЗАЛИТЬ НА GITHUB.
#
# Создать проект GitRepo в качестве локального репозитория.
#
# Создать репозиторий на github с тем же названием.
#
# Если этого не сделано! Настроить ssh между локальным пк и удалённым аккаунтом github.
#
# Настроить связь между локальным и удалённым.
#
# Проверить настроенную связь.
#
# Залить текущие изменения в локальном репозитории в удаленный.
#
# Создать папку hidden в корне проекта и добавить её в gitignore так, чтоб все файлы в ней тоже были скрыты.
#
# Залить изменения на удаленный репозиторий.
#
# Создать в папке hidden файл hidden_test_file.py
#
# Проверить видит ли git папку hidden и файлы в ней
#
#
#
#
#
#
#